{
  "basics": {
    "name": "Lennaert van Veen",
    "profession": "Professor of Mathematics",
    "image": "",
    "email": "lennaert.vanveen@ontariotechu.ca",
    "url": "https://lvanveen.github.io/",
    "summary": "Researcher and lecturer in the intersection of applied math, physics and scientific computing.",
    "location": {
      "address": "Ontario Tech University",
      "city": "Oshawa",
      "countryCode": "CA",
      "region": "Ontario"
    }
  },
  "work": [
    {
      "name": "Faculty of Science, Ontario Tech University",
	"position": "Professor of Applied Mathematics",
	"url": "https://science.ontariotechu.ca/",
      "startDate": "2009-08-01",
      "endDate": "present",
      "summary": "Also Director of the Modelling and Computational Science program.",
      "highlights": ["Dynamical Systems","Scientific Computing"]
    },
      {
	  "name": "Department of Mathematics, Concordia University",
	  "position": "Professor of Applied Mathematics",
	  "url": "https://www.concordia.ca/artsci/math-stats.html",
	  "startDate": "2007-07-01",
	  "endDate": "2009-08-01"
      },
      {
	  "name": "AMS COE on Mathematics and Statistics of Complex Systems",
	  "position": "Postdoctoral researcher and lecturer at La Trobe University",
	  "startDate": "2005-05-01",
	  "endDate": "2007-05-01"
      },
      {
	  "name": "National Institute for Fusion Science and Kyoto University",
	  "position": "Postdoctoral researcher",
	  "url": "https://www.nifs.ac.jp/en/",
	  "startDate": "2003-04-01",
	  "endDate": "2005-04-30"
      }
  ],
  "education": [
    {
      "institution": "Utrecht University",
      "location": "Utrecht, Netherlands",
      "url": "https://www.uu.nl/en/organisation/department-of-mathematics",
      "area": "Applied Mathematics",
      "studyType": "PhD",
      "startDate": "1997",
      "endDate": "2002"
    },
    {
	"institution": "University of Amsterdam",
	"location": "Amsterdam, Netherlands",
	"url": "https://www.uva.nl/shared-content/programmas/en/masters/physics-and-astronomy-theoretical-physics/theoretical-physics.html",
	"area": "Theoretical Physics",
	"studyType": "MSc",
	"startDate": "1991",
	"endDate": "1996"
    }
  ],
  "certificates": [
    {
      "name": "TCPS 2: CORE-2022 (Course on Research Ethics)",
      "date": "2020",
      "issuer": "The Tri-Council Policy Statement: Ethical Conduct for Research Involving Humans (TCPS 2)",
      "url": "http://tcps2core.ca/welcome",
      "icon": "fa-solid fa-location-dot"
    }
  ],
  "publications": [
    {
      "name": "Time scale interaction in low-order climate models",
      "publisher": "PhD thesis at Utrecht University",
      "releaseDate": "April 2002",
      "url": "https://dspace.library.uu.nl/handle/1874/870",
      "summary": "Although nominally about climate modelling, this thesis is mostly about the bifurcation analysis of systems with multiple time scales."
    },
      {
      "name": "Transfer Matrix Analysis of Random Tiling Models using the Bethe Ansatz",
      "publisher": "MSc. thesis at the University of Amsterdam",
	"releaseDate": "August 1996",
      "summary": "My Master's thesis on the statistical properties of random tilings of the plane using transfer matrices."
    }           
  ],
  "skills": [
    {
      "name": "Physics",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Fluid dynamics",
        "Statistical Physics"
      ]
    },
      {
	  "name": "Mathematics",
	  "level": "Master",
	  "icon": "fa-solid fa-hashtag",
	  "keywords": [
	      "Dynamical systems",
	      "Modelling"
	  ]
      },
      {
	  "name": "Scientific computing",
	  "level": "Master",
	  "icon": "fa-solid fa-hashtag",
	  "keywords": [
	      "Thread parallel programming (OMP)",
	      "Process parallel programming (MPI)",
	      "GPU programming (CUFortran, NVHPC)",
	      "Python/NumPy/NumBa/Pandas/..."
	  ]
      }
  ],
  "languages": [
    {
      "language": "Dutch",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
      {
	  "language": "French, German, Japanese",
	  "fluency": "Can survive",
	  "icon": ""
      }
  ],
  "interests": [
    {
      "name": "Currently thinking about:",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Coarse-grained (integro-differential) models of bacterial motion",
        "Finite-sized perturbations to linearly stable swirling flow",
        "Obtaining flickering noise from Markov chains",
        "Scaling laws in deterministic KS dynamics"
      ]
    },
      {
	  "name": "Currently crying about:",
	  "icon": "fa-solid fa-tag",
      "keywords": [
          "Checking and profiling CUDA Fortran code",
	  "Optimizing NumPy code with NumBa",
	  "Getting this GitHUb web page to work"
      ]
      }
  ],
    "projects": [
	
    {
      "name": "On the emergence of scaling laws",
      "summary": "In many physical, physiological and biological systems the observables of interest are averages over ensembles, time or space. Such aggregate quantities often reveal scaling behaviour that cannot be identified in the constituent data - e.g. a single realization or a single snap shot of the system. Scaling behaviour takes the form of a power law and hints at a form of self-similarity. For example, the famous -5/3 spectrum of the energy distribution over spatial scales in a turbulent fluid hints a the existence of a hierarchy of similar structures on a range of scales. In the formation of such structures, energy is extracted from larger ones and in their breakdown, energy is transfered to smaller ones. Similarly, in the growth of interfaces by deposition processes, there is a regime in which the interface has the same statistical properties on a range of length scales. The three interlinked projects I propose to complete with Discovery funding aim to establish robust links between the underlying dynamics on one hand and the emerging scaling laws on the other. I will consider systems in one, two and three spatial dimensions. The first project concerns the presence or absence of Kardar-Parisi-Zhang (KPZ) scaling in the Kuramoto-Sivashinski (KS) equation. It is a long standing hypothesis that the deterministic KS equation generates solutions that exhibit the same scaling laws as interfaces growing by deposition as described by the discrete, stochastic dynamics of sand pile models. In particular, the hypothesis is that the root-mean-square of the solution, averaged over an ensemble of realizations, scales with a KPZ exponent in time. To date, no convincing numerical evidence has been presented to support this hypothesis and theoretical work is inconclusive. A critical examination of early numerical work reveals that, in most cases, crude numerical methods were used and the presence of truncation and rounding errors blurred the line between the deterministic and stochastically forced KS equation. Accurate data are hard to generate since large ensembles, long simulation times and small time steps are required. In a series of GPU-based computations, we are gathering a sufficiently large volume of data to test the hypothesis more accurately than ever done before. The second project concerns the motion of bacteria on a two-dimensional surface. In this case, it is the dynamics of the individual bacteria that can lead to the formation of clusters, also called rafts. The simplest mechanism is for cigar-shaped bacteria to move along the surface roughly along the major axis of their body. When they collide, they are forced to align or anti-align due to the contact forces. Thus, in regions with a sufficiently dense packing of organisms, collective motion can arise even in the absence of direct communication such as through chemotaxis. While the formation and break-up of a single raft is a stochastic process, averaging over many realizations is expected to yield a reproducible distribution of surface areas and life times of rafts. A difficulty is that the simulation of the microscopic dynamics with sufficiently many interacting bacteria over long enough time intervals is extremely computationally demanding. Instead, we propose a novel continuous model that predicts the density of bacteria through a non-local, non-linear partial differential equation. Potentially, this continuum model will allow us to simulate larger systems for longer time intervals and yield enough data on raft dynamics to accurately estimate the relevant distributions. Before we generate such data, however, it is imperative to justify and tune the continuous model using results from microscopic, agent-based simulations as well as experimental data. At the same time, a theoretical treatment of the model can lead to an exact or asymptotic description of such structures as travelling fronts and regularly shaped rafts. We will explore the model solutions both with numerical means and through bifurcation theory and asymptotic arguments. Lastly, we turn to Navier-Stokes flow. In recent years, various mechanisms have been proposed for a self-similar decay of coherent structures that may explain the -5/3 power-law behaviour. Often, these mechanisms are based on vortical structures. Structures like vortex tubes and sheets can form spontaneously and persist on time scales much longer than that of the coherent motion of individual fluid particles and on a range of spatial scales. In order to study the process of the formation and breakdown of vortical structures, we turn to the Burgers vortex. This is an exact solution to the Navier-Stokes equations, in which viscous damping is balanced by vortex stretching. Remarkably, this solution has been shown to be asymptotically stable. As is well-known from the study of shear flows, asymptotically stable solutions can be unstable to finite-sized perturbations at sufficiently high Reynolds numbers. Such perturbation can lead to dynamics of intermediate complexity - more intricate and less symmetric than the stable solution itself but less disordered than turbulence. In shear flow, examples of flows triggered by finite-sized perturbations include equilibrium and periodically modulated travelling waves. We expect that, in the case of Burgers flow, finite-sized perturbations will trigger the creation of vortical structures more realistic than the Burgers vortex itself, for instance exhibiting elliptical cores and pressure waves along the vortex axis. At sufficiently high Reynolds numbers, we may see the creation of smaller vortices that consume energy from the Burgers vortex and study it as one step in the cascade of such breakdowns and formations. Each of the projects offers a mix of theoretical and computational work that will largely be executed by students. They will study dynamical systems theory, in particular the analytical and numerical treatment of bifurcations, the composition and implementation of numerical algorithms as well as error analysis and optimization of production codes. ",
	"highlights": ["RGPIN-2025-05842"],
      "startDate": "2025",
      "endDate": "2030"      
    },	
    {
      "name": "The interplay of dynamics and statistics in physical and biological models",
      "summary": "This program comprises three interrelated projects in the intersection of nonlinear dynamics and statistics: fluid turbulence, moving interfaces and the motility of bacteria. In each of these phenomena, intricate nonlinear dynamics give rise to robust properties of quantities averaged over time, space or realizations. In fluid turbulence, the continuous formation and breakdown of coherent structures conspire to produce, on average, the famous Kolmogorov power law for the distribution of energy over spatial scales. In the study of moving interfaces, in particular model in the famous model by Kuramoto and Sivashinsky, it is an open question what statistical behaviour the transient dynamics result in. Over thirty five years ago, Yakhot conjectured that the statistical properties of the model should be the same as those of the Kardar-Parisi-Zhang universality class. The premise is that the fast motion on small scales effectively acts as stochastic forcing on the slow motion on large scales. There is, however, no conclusive evidence to support or reject the conjecture. We will use cutting-edge, GPU based algorithms of computational dynamical systems theory to shed new light on these classical problems.\n The mathematical description of bacterial motility is much younger than that of fluid turbulence and interface formation. Since experiments have revealed details of the motion of individual cells, the most common approach to simulating collective motion is agent based. If the simulation is long enough, and contains enough agents, it can exhibit the formation of clusters of cells that move in unison. However, even with the aid of GPU computing, we can only simulate microscopically small clusters. Our question is whether we can formulate a continuum model of cluster formation. Since coarse-grained, continuous simulations are more tractable, they will allow us to address open questions about the macroscopic properties of collective motion, such as captured by distributions of cluster sizes.",
	"highlights": ["RGPIN-2019-05443"],
      "startDate": "2019",
      "endDate": "2024"      
    }
  ]
}
